packages/StoveOpt/StoveOpt-0.3.4-py2-none-any.whl/StoveOpt/foamfiles/counterFlowFlame2D/0_template/CH4
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CH4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform 1.0;
    }
    primary_air
    {
        type            fixedValue;
        value           uniform 0.0;
    }
	Secondary_air_LHS
	{
		type			fixedValue;
		value			uniform 0.0;
	}	
	Secondary_air_RHS
	{
		type			fixedValue;
		value			uniform 0.0;
	}		
	stove_body
	{
		type			fixedValue;
		value			uniform 0.0;
	}
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
